# Mask R-CNN with Inception Resnet v2 (no atrous)
# Sync-trained on COCO (with 8 GPUs) with batch size 16 (1024x1024 resolution)
# Initialized from Imagenet classification checkpoint
# TF2-Compatible, *Not* TPU-Compatible
#
# Achieves XXX mAP on COCO

model {
  faster_rcnn {
    number_of_stages: 3
    num_classes: 3
    image_resizer {
      fixed_shape_resizer {
        height: 600
        width: 600
        # pad_to_max_dimension: true
      }
    }
    feature_extractor {
      type: 'faster_rcnn_inception_resnet_v2_keras'
    }
    first_stage_anchor_generator {
      grid_anchor_generator {
        scales: [0.25, 0.5, 1.0, 2.0]
        aspect_ratios: [0.5, 1.0, 2.0]
        height_stride: 16
        width_stride: 16
      }
    }
    first_stage_box_predictor_conv_hyperparams {
      op: CONV
      regularizer {
        l2_regularizer {
          weight: 0.0
        }
      }
      initializer {
        truncated_normal_initializer {
          stddev: 0.01
        }
      }
    }
    first_stage_nms_score_threshold: 0.0
    first_stage_nms_iou_threshold: 0.7
    first_stage_max_proposals: 300
    first_stage_localization_loss_weight: 2.0
    first_stage_objectness_loss_weight: 1.0
    initial_crop_size: 17
    maxpool_kernel_size: 1
    maxpool_stride: 1
    second_stage_box_predictor {
      mask_rcnn_box_predictor {
        use_dropout: false
        dropout_keep_probability: 1.0
        fc_hyperparams {
          op: FC
          regularizer {
            l2_regularizer {
              weight: 0.0
            }
          }
          initializer {
            variance_scaling_initializer {
              factor: 1.0
              uniform: true
              mode: FAN_AVG
            }
          }
        }
        mask_height: 25
        mask_width: 25
        mask_prediction_conv_depth: 0
        mask_prediction_num_conv_layers: 4
        conv_hyperparams {
          op: CONV
          regularizer {
            l2_regularizer {
              weight: 0.0
            }
          }
          initializer {
            truncated_normal_initializer {
              stddev: 0.01
            }
          }
        }
        predict_instance_masks: true
      }
    }
    second_stage_post_processing {
      batch_non_max_suppression {
        score_threshold: 0.0
        iou_threshold: 0.6
        max_detections_per_class: 100
        max_total_detections: 100
      }
      score_converter: SOFTMAX
    }
    second_stage_localization_loss_weight: 2.0
    second_stage_classification_loss_weight: 1.0
    second_stage_mask_prediction_loss_weight: 4.0
    resize_masks: false
  }
}
train_config {
  batch_size: 1
  data_augmentation_options {
    random_horizontal_flip {
    }
  }
  data_augmentation_options {
    random_crop_image {
      min_object_covered: 1.0
      min_aspect_ratio: 0.9
      max_aspect_ratio: 1.1
      min_area: 0.95
      max_area: 1.0
      overlap_thresh: 0.9
      random_coef: 0.1
      clip_boxes: true
    }
  }
  data_augmentation_options {
    random_pad_image {
      min_image_height: 0
      min_image_width: 0
      max_image_height: 612
      max_image_width: 612
    }
  }
  data_augmentation_options {
    random_adjust_brightness {
      max_delta: 0.3
    }
  }
  data_augmentation_options {
    random_rgb_to_gray {
      probability: 0.2
    }
  }
  keep_checkpoint_every_n_hours: 10.0
  optimizer {
    momentum_optimizer {
      learning_rate {
        manual_step_learning_rate {
          initial_learning_rate: 0.0002
          schedule {
            step: 50000
            learning_rate: 0.0002
          }
          schedule {
            step: 120000
            learning_rate: 2e-05
          }
          schedule {
            step: 160000
            learning_rate: 2e-06
          }
        }
      }
      momentum_optimizer_value: 0.9
    }
    use_moving_average: false
    moving_average_decay: 0.9999
  }
  gradient_clipping_by_norm: 10.0
  fine_tune_checkpoint: "C:\\Users\\jf468\\PycharmProjects\\hiwi_fliegel\\model\\mask_rcnn_inception_resnet_v2_checkpoint\\ckpt-0"
  fine_tune_checkpoint_type: "detection"
  fine_tune_checkpoint_version: V2
  num_steps: 200000
}
train_input_reader {
  label_map_path: "C:\\Users\\jf468\\PycharmProjects\\hiwi_fliegel\\data\\data_pu_cropped\\label_map.pbtxt"
  load_instance_masks: true
  tf_record_input_reader {
    input_path: "C:\\Users\\jf468\\PycharmProjects\\hiwi_fliegel\\data\\data_pu_cropped\\2021-03-18_train_pu_cropped_data.tfrecords"
  }
  mask_type: PNG_MASKS
}
eval_config {
  num_visualizations: 0
  num_examples: 150
  metrics_set: "coco_mask_metrics"
  include_metrics_per_category: true
}
eval_input_reader {
  label_map_path: "C:\\Users\\jf468\\PycharmProjects\\hiwi_fliegel\\data\\data_pu_cropped\\label_map.pbtxt"
  shuffle: false
  queue_capacity: 8
  min_after_dequeue: 4
  num_epochs: 1
  num_readers: 1
  load_instance_masks: true
  tf_record_input_reader {
    input_path: "C:\\Users\\jf468\\PycharmProjects\\hiwi_fliegel\\data\\data_pu_cropped\\2021-03-18_evaluation_pu_cropped_data.tfrecords"
  }
  mask_type: PNG_MASKS
  prefetch_size: 4
  num_parallel_batches: 1
  num_prefetch_batches: 1
}